import { Status, UserRole, PrincipalType, LegalEntityPrincipalType } from "../constants";

export const getData = ({
    status = Status.Draft,
    userRole = UserRole.Owner,
    principalType = PrincipalType.LegalEntityPrincipal,
    legalEntityPrincipalType = LegalEntityPrincipalType.LegalEntityPerson,
} = {}) => ({
    userRole,
    mchd: {
        id: null,
        fio: "Никита Случевский Ефремович",
        created: "2023-11-18T00:00:00.000+03:00",
        extensionNumber: "12345",
        number: "00878513-01d6-481c-a457-0ea6059e5fe9",
        validity: "2023-11-23T00:00:00.000+03:00",
        type: principalType,
        legalEntityPrincipal: {
            id: "98de3b20-6f28-11ee-bd29-e5e06384a8a9",
            companyName: "Филиал с КПП для ЭКД",
            inn: "1136943156",
            ogrn: "9122563471791",
            kpp: "924345936",
            region: "7700000000000",
            type: legalEntityPrincipalType,
            legalEntityPerson: {
                firstName: "Фамилия",
                middleName: "Отчество",
                lastName: "Имя",
                snils: "12312312312",
                birthday: "2023-11-18T00:00:00.000+03:00",
                inn: "1121212121",
                companyName: "Компания",
                ogrn: "3432453534534",
                kpp: "234234234",
                region: "7700000000000",
            },
            person: {
                firstName: "Arakantsev",
                middleName: "Отчество",
                lastName: "Имя",
                snils: "11111111212",
                birthday: "2023-11-14T00:00:00.000+03:00",
                inn: "233222222333",
            },
        },
        individualEntrepreneurPrincipal: {
            firstName: "Имя",
            middleName: "Отчество",
            lastName: "Фамилия",
            snils: "32312312312",
            birthday: "2023-11-18T19:56:06.858Z",
            inn: "342432090900",
            id: null,
            companyName: "Компания",
            ogrn: "342432090900",
        },
        representative: {
            firstName: "Случевский",
            middleName: "Ефремович",
            lastName: "Никита",
            snils: "32312312312",
            birthday: "2023-11-07T00:00:00.000+03:00",
            inn: "342432090900",
            id: "98de3b20-6f28-11ee-bd29-e5e06384a8a9",
            documentType: "81",
            seriesAndNumber: "121212121",
            authorityDocument: "Отдел милиции",
            authorityCodeDocument: "1231232",
            validity: "2023-11-29T00:00:00.000+03:00",
            created: "2023-11-17T00:00:00.000+03:00",
        },
        status,
        actions: ["delete", "sign"],
    },
    documentTypes: [
        {
            code: "6",
            shortName: "ПасММФ",
            template: "ББ 999999",
            comment: "Паспорт моряка Минморфлота СССР (РФ), выданный до 1997г.",
            name: "Паспорт Минморфлота ",
        },
        {
            code: "81",
            shortName: "СвдСм",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment: "Свидетельство о смерти",
            name: "Свидетельство о смерти",
        },
        {
            code: "16",
            shortName: "УдЛбГ",
            template: "999 999 999",
            comment:
                "Ст.5.2 ФЗ от 25.06.2002 г. №115-ФЗ «О правовом положении иностранных граждан в Российской Федерации», Приказ МВД России от 04.06.2021 №395 «Об утверждении формы и описания бланка временного удостоверения личности лица без гражданства в РФ»",
            name: "Временное удостоверение личности лица без гражданства в РФ",
        },
        {
            code: "26",
            shortName: "ПасМор",
            template: "ББ 0999999",
            comment:
                "Паспорт моряка (удостоверение личности гражданина, работающего на судах заграничного плавания или на иностранных судах) образца 1997 г.",
            name: "Паспорт моряка ",
        },
        {
            code: "19",
            shortName: "СвВрУб",
            template: "ББ   9999999",
            comment: "Приказ ФМС России от 25.03.2011 № 81",
            name: "Свидетельство о предоставлении временного убежища на территории Российской Федерации",
        },
        {
            code: "13",
            shortName: "УдсБеж",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment:
                'Для лиц (не граждан Российской Федерации), признанных беженцами в соответствии со статьями 1 и 7 Федерального закона от 19.02.1993 N 4528-1 "О беженцах"',
            name: "Удостоверение беженца",
        },
        {
            code: "60",
            shortName: "ДкРгМЖ",
            template: null,
            comment:
                "Группировка документов (коды 61-69), подтверждающих факт регистрации по месту жительства, но не удостоверяющих личность",
            name: "Документы, подтверждающие факт регистрации по месту жительства (пребывания)",
        },
        {
            code: "21",
            shortName: "ПасРФ",
            template: "99 99 9999990",
            comment:
                'Постановление Правительства Российской Федерации от 08.07.1997 № 828 "Об утверждении Положения о паспорте гражданина Российской Федерации, образца бланка и описания паспорта гражданина Российской Федерации"',
            name: "Паспорт гражданина Российской Федерации",
        },
        {
            code: "7",
            shortName: "ВоеБил",
            template: "ББ 0999999",
            comment:
                'Положение о воинском учете, утвержденное постановлением Правительства Российской Федерации от 27.11.2006 № 719 "Об утверждении Положения о воинском учете"',
            name: "Военный билет",
        },
        {
            code: "9",
            shortName: "ПасДип",
            template: "999 999 999",
            comment:
                "Дипломатический паспорт для граждан Российской Федерации (Постановление Правительства Российской Федерации от 14.03.1997 N 298)",
            name: "Дипломатический паспорт",
        },
        {
            code: "91",
            shortName: "ИныеДк",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment:
                "Иные документы, предусмотренные законодательством Российской Федерации или международными договорами в качестве документов, удостоверяющих личность",
            name: "Иные документы ",
        },
        {
            code: "15",
            shortName: "РазрВр",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment:
                "Для лиц без гражданства, не имеющих документа, удостоверяющего личность (Положение о выдаче иностранным гражданам и лицам без гражданства разрешения на временное проживание, утвержденное постановлением Правительства Российской Федерации от 01.11.2002 № 789)",
            name: "Разрешение на временное проживание в Российской Федерации",
        },
        {
            code: "10",
            shortName: "ПасИнс",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment:
                'Документ, удостоверяющий личность иностранного гражданина в Российской Федерации (Федеральный закон от 25.07.2002 N 115-ФЗ "О правовом положении иностранных граждан в Российской Федерации")',
            name: "Паспорт иностранного гражданина ",
        },
        {
            code: "4",
            shortName: "УдЛичн",
            template: "ББ 0999999",
            comment:
                "Для военнослужащих (офицеров, прапорщиков, мичманов) - (заменено в 2004 году на Удостоверение личности военнослужащего Российской Федерации)",
            name: "Удостоверение личности офицера",
        },
        {
            code: "3",
            shortName: "СвдРжд",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment:
                "Для лиц, не достигших 16-летнего (с 01.10.1997 -14-летнего) возраста, оформленное в соответствии с законодательством Российской Федерации",
            name: "Свидетельство о рождении ",
        },
        {
            code: "5",
            shortName: "Справ",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment: "Для лиц, освободившихся из мест лишения свободы",
            name: "Справка об освобождении из места лишения свободы",
        },
        {
            code: "61",
            shortName: "СвдРег",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment: "Свидетельство о регистрации по месту жительства ",
            name: "Свидетельство о регистрации по месту жительства ",
        },
        {
            code: "18",
            shortName: "СвУбДо",
            template: "ББ-999 9999999",
            comment:
                "Положение о свидетельстве о предоставлении временного убежища на территории Российской Федерации, утвержденное постановлением Правительства Российской Федерации от 09.04.2001 № 274",
            name: "Свидетельство о предоставлении временного убежища на территории Российской Федерации (до 01.01.2013)",
        },
        {
            code: "28",
            shortName: "СлуПас",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment:
                "Приказ МИД России от 21.07.2014 № 12457(Зарегистрировано в Министерстве юстиции Российской Федерации 15.08.2014 № 33614)",
            name: "Служебный паспорт гражданина Российской Федерации",
        },
        {
            code: "14",
            shortName: "ВрУдсЛ",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment:
                "Временное удостоверение личности гражданина Российской Федерации по форме N 2П (приказ МВД России от 28.12.2006 N 1105, зарегистрированный в Минюсте России 08.02.2007, регистрационный номер 8910)",
            name: "Временное удостоверение личности гражданина Российской Федерации",
        },
        {
            code: "8",
            shortName: "ВрУдВБ",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment:
                'Положение о воинском учете, утвержденное постановлением Правительства Российской Федерации от 27.11.2006 № 719 "Об утверждении Положения о воинском учете"',
            name: "Временное удостоверение, выданное взамен военного билета",
        },
        {
            code: "62",
            shortName: "ВдЖтИГ",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment: "Документ, подтверждающий факт регистрации иностранного гражданина по месту жительства",
            name: "Вид на жительство иностранного гражданина",
        },
        {
            code: "63",
            shortName: "СвдПрб",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment: "Свидетельство о регистрации по месту пребывания",
            name: "Свидетельство о регистрации по месту пребывания",
        },
        {
            code: "2",
            shortName: "ПасЗгр",
            template: "990 999 999",
            comment:
                "Паспорт, удостоверяющий личность гражданина Российской Федерации за пределами Российской Федерации, образца до 1997 года (Указ Президента Российской Федерации от 21.12.1996 N1752)",
            name: "Загранпаспорт гражданина СССР ",
        },
        {
            code: "22",
            shortName: "ПасЗаг",
            template: "999 999 999",
            comment:
                "Паспорт, удостоверяющий личность гражданина Российской Федерации за пределами Российской Федерации, образца 1997 года",
            name: "Загранпаспорт гражданина Российской Федерации ",
        },
        {
            code: "12",
            shortName: "ВидЖит",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment:
                'Постановление Правительства Российской Федерации от 01.11.2002 N 794 "Об утверждении Положения о выдаче иностранным гражданам и лицам без гражданства вида на жительство"',
            name: "Вид на жительство в Российской Федерации ",
        },
        {
            code: "23",
            shortName: "СвРжИн",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment: "Для иностранных граждан, не достигших 16-летнего возраста",
            name: "Свидетельство о рождении, выданное уполномоченным органом иностранного государства",
        },
        {
            code: "24",
            shortName: "УдВоен",
            template: "ББ 9999999",
            comment:
                'Постановление Правительства Российской Федерации от 12.02.2003 N 91 "Об удостоверении личности военнослужащего Российской Федерации"',
            name: "Удостоверение личности военнослужащего Российской Федерации",
        },
        {
            code: "11",
            shortName: "СвиРег",
            template: "SSSSSSSSSSSSSSSSSSSSSSSSS",
            comment:
                'Для лиц, ходатайствующих о признании беженцем на территории Российской Федерации (Постановление Правительства Российской Федерации от 28.05.1998 N 523 "О свидетельстве о рассмотрении ходатайства о признании беженцем на территории Российской Федерации по существу")',
            name: "Свидетельство о рассмотрении ходатайства о признании лица беженцем на территории Российской Федерации по существу",
        },
        {
            code: "1",
            shortName: "ПаСССР",
            template: "R-ББ 999999",
            comment:
                'Постановление Правительства РФ от 24.02.2009 N 153 "О признании действительными до 1 июля 2009 г. паспортов гражданина СССР образца 1974 года для некоторых категорий иностранных граждан и лиц без гражданства"',
            name: "Паспорт гражданина СССР ",
        },
        {
            code: "27",
            shortName: "ВоеЗап",
            template: "ББ 0999999",
            comment: "Военный билет офицера запаса ",
            name: "Военный билет офицера запаса",
        },
    ],
    regions: [
        {
            key: "7700000000000",
            text: "г. Москва",
        },
        {
            key: "7800000000000",
            text: "г. Санкт-Петербург",
        },
        {
            key: "9200000000000",
            text: "г. Севастополь",
        },
        {
            key: "9900000000000",
            text: "г. Байконур",
        },
        {
            key: "2200000000000",
            text: "Алтайский край",
        },
        {
            key: "2800000000000",
            text: "Амурская область",
        },
        {
            key: "2900000000000",
            text: "Архангельская область",
        },
        {
            key: "3000000000000",
            text: "Астраханская область",
        },
        {
            key: "3100000000000",
            text: "Белгородская область",
        },
        {
            key: "3200000000000",
            text: "Брянская область",
        },
        {
            key: "3300000000000",
            text: "Владимирская область",
        },
        {
            key: "3400000000000",
            text: "Волгоградская область",
        },
        {
            key: "3500000000000",
            text: "Вологодская область",
        },
        {
            key: "3600000000000",
            text: "Воронежская область",
        },
        {
            key: "9300000000000",
            text: "Донецкая Народная республика",
        },
        {
            key: "7900000000000",
            text: "Еврейская автономная область",
        },
        {
            key: "7500000000000",
            text: "Забайкальский край",
        },
        {
            key: "9000000000000",
            text: "Запорожская область",
        },
        {
            key: "3700000000000",
            text: "Ивановская область",
        },
        {
            key: "3800000000000",
            text: "Иркутская область",
        },
        {
            key: "0700000000000",
            text: "Кабардино-Балкарская Республика",
        },
        {
            key: "3900000000000",
            text: "Калининградская область",
        },
        {
            key: "4000000000000",
            text: "Калужская область",
        },
        {
            key: "4100000000000",
            text: "Камчатский край",
        },
        {
            key: "0900000000000",
            text: "Карачаево-Черкесская Республика",
        },
        {
            key: "4200000000000",
            text: "Кемеровская область - Кузбасс",
        },
        {
            key: "4300000000000",
            text: "Кировская область",
        },
        {
            key: "4400000000000",
            text: "Костромская область",
        },
        {
            key: "2300000000000",
            text: "Краснодарский край",
        },
        {
            key: "2400000000000",
            text: "Красноярский край",
        },
        {
            key: "4500000000000",
            text: "Курганская область",
        },
        {
            key: "4600000000000",
            text: "Курская область",
        },
        {
            key: "4700000000000",
            text: "Ленинградская область",
        },
        {
            key: "4800000000000",
            text: "Липецкая область",
        },
        {
            key: "9400000000000",
            text: "Луганская Народная республика",
        },
        {
            key: "4900000000000",
            text: "Магаданская область",
        },
        {
            key: "5000000000000",
            text: "Московская область",
        },
        {
            key: "5100000000000",
            text: "Мурманская область",
        },
        {
            key: "8300000000000",
            text: "Ненецкий автономный округ",
        },
        {
            key: "5200000000000",
            text: "Нижегородская область",
        },
        {
            key: "5300000000000",
            text: "Новгородская область",
        },
        {
            key: "5400000000000",
            text: "Новосибирская область",
        },
        {
            key: "5500000000000",
            text: "Омская область",
        },
        {
            key: "5600000000000",
            text: "Оренбургская область",
        },
        {
            key: "5700000000000",
            text: "Орловская область",
        },
        {
            key: "5800000000000",
            text: "Пензенская область",
        },
        {
            key: "5900000000000",
            text: "Пермский край",
        },
        {
            key: "2500000000000",
            text: "Приморский край",
        },
        {
            key: "6000000000000",
            text: "Псковская область",
        },
        {
            key: "0100000000000",
            text: "Республика Адыгея (Адыгея)",
        },
        {
            key: "0400000000000",
            text: "Республика Алтай",
        },
        {
            key: "0200000000000",
            text: "Республика Башкортостан",
        },
        {
            key: "0300000000000",
            text: "Республика Бурятия",
        },
        {
            key: "0500000000000",
            text: "Республика Дагестан",
        },
        {
            key: "0600000000000",
            text: "Республика Ингушетия",
        },
        {
            key: "0800000000000",
            text: "Республика Калмыкия",
        },
        {
            key: "1000000000000",
            text: "Республика Карелия",
        },
        {
            key: "1100000000000",
            text: "Республика Коми",
        },
        {
            key: "9100000000000",
            text: "Республика Крым",
        },
        {
            key: "1200000000000",
            text: "Республика Марий Эл",
        },
        {
            key: "1300000000000",
            text: "Республика Мордовия",
        },
        {
            key: "1400000000000",
            text: "Республика Саха (Якутия)",
        },
        {
            key: "1500000000000",
            text: "Республика Северная Осетия - Алания",
        },
        {
            key: "1600000000000",
            text: "Республика Татарстан (Татарстан)",
        },
        {
            key: "1700000000000",
            text: "Республика Тыва",
        },
        {
            key: "1900000000000",
            text: "Республика Хакасия",
        },
        {
            key: "6100000000000",
            text: "Ростовская область",
        },
        {
            key: "6200000000000",
            text: "Рязанская область",
        },
        {
            key: "6300000000000",
            text: "Самарская область",
        },
        {
            key: "6400000000000",
            text: "Саратовская область",
        },
        {
            key: "6500000000000",
            text: "Сахалинская область",
        },
        {
            key: "6600000000000",
            text: "Свердловская область",
        },
        {
            key: "6700000000000",
            text: "Смоленская область",
        },
        {
            key: "2600000000000",
            text: "Ставропольский край",
        },
        {
            key: "6800000000000",
            text: "Тамбовская область",
        },
        {
            key: "6900000000000",
            text: "Тверская область",
        },
        {
            key: "7000000000000",
            text: "Томская область",
        },
        {
            key: "7100000000000",
            text: "Тульская область",
        },
        {
            key: "7200000000000",
            text: "Тюменская область",
        },
        {
            key: "1800000000000",
            text: "Удмуртская Республика",
        },
        {
            key: "7300000000000",
            text: "Ульяновская область",
        },
        {
            key: "2700000000000",
            text: "Хабаровский край",
        },
        {
            key: "8600000000000",
            text: "Ханты-Мансийский автономный округ - Югра",
        },
        {
            key: "9500000000000",
            text: "Херсонская область",
        },
        {
            key: "7400000000000",
            text: "Челябинская область",
        },
        {
            key: "2000000000000",
            text: "Чеченская Республика",
        },
        {
            key: "2100000000000",
            text: "Чувашская Республика - Чувашия",
        },
        {
            key: "8700000000000",
            text: "Чукотский автономный округ",
        },
        {
            key: "8900000000000",
            text: "Ямало-Ненецкий автономный округ",
        },
        {
            key: "7600000000000",
            text: "Ярославская область",
        },
    ],
});
