export const regions = [
    {
        key: "7700000000000",
        text: "г. Москва",
    },
    {
        key: "7800000000000",
        text: "г. Санкт-Петербург",
    },
    {
        key: "9200000000000",
        text: "г. Севастополь",
    },
    {
        key: "9900000000000",
        text: "г. Байконур",
    },
    {
        key: "2200000000000",
        text: "Алтайский край",
    },
    {
        key: "2800000000000",
        text: "Амурская область",
    },
    {
        key: "2900000000000",
        text: "Архангельская область",
    },
    {
        key: "3000000000000",
        text: "Астраханская область",
    },
    {
        key: "3100000000000",
        text: "Белгородская область",
    },
    {
        key: "3200000000000",
        text: "Брянская область",
    },
    {
        key: "3300000000000",
        text: "Владимирская область",
    },
    {
        key: "3400000000000",
        text: "Волгоградская область",
    },
    {
        key: "3500000000000",
        text: "Вологодская область",
    },
    {
        key: "3600000000000",
        text: "Воронежская область",
    },
    {
        key: "9300000000000",
        text: "Донецкая Народная республика",
    },
    {
        key: "7900000000000",
        text: "Еврейская автономная область",
    },
    {
        key: "7500000000000",
        text: "Забайкальский край",
    },
    {
        key: "9000000000000",
        text: "Запорожская область",
    },
    {
        key: "3700000000000",
        text: "Ивановская область",
    },
    {
        key: "3800000000000",
        text: "Иркутская область",
    },
    {
        key: "0700000000000",
        text: "Кабардино-Балкарская Республика",
    },
    {
        key: "3900000000000",
        text: "Калининградская область",
    },
    {
        key: "4000000000000",
        text: "Калужская область",
    },
    {
        key: "4100000000000",
        text: "Камчатский край",
    },
    {
        key: "0900000000000",
        text: "Карачаево-Черкесская Республика",
    },
    {
        key: "4200000000000",
        text: "Кемеровская область - Кузбасс",
    },
    {
        key: "4300000000000",
        text: "Кировская область",
    },
    {
        key: "4400000000000",
        text: "Костромская область",
    },
    {
        key: "2300000000000",
        text: "Краснодарский край",
    },
    {
        key: "2400000000000",
        text: "Красноярский край",
    },
    {
        key: "4500000000000",
        text: "Курганская область",
    },
    {
        key: "4600000000000",
        text: "Курская область",
    },
    {
        key: "4700000000000",
        text: "Ленинградская область",
    },
    {
        key: "4800000000000",
        text: "Липецкая область",
    },
    {
        key: "9400000000000",
        text: "Луганская Народная республика",
    },
    {
        key: "4900000000000",
        text: "Магаданская область",
    },
    {
        key: "5000000000000",
        text: "Московская область",
    },
    {
        key: "5100000000000",
        text: "Мурманская область",
    },
    {
        key: "8300000000000",
        text: "Ненецкий автономный округ",
    },
    {
        key: "5200000000000",
        text: "Нижегородская область",
    },
    {
        key: "5300000000000",
        text: "Новгородская область",
    },
    {
        key: "5400000000000",
        text: "Новосибирская область",
    },
    {
        key: "5500000000000",
        text: "Омская область",
    },
    {
        key: "5600000000000",
        text: "Оренбургская область",
    },
    {
        key: "5700000000000",
        text: "Орловская область",
    },
    {
        key: "5800000000000",
        text: "Пензенская область",
    },
    {
        key: "5900000000000",
        text: "Пермский край",
    },
    {
        key: "2500000000000",
        text: "Приморский край",
    },
    {
        key: "6000000000000",
        text: "Псковская область",
    },
    {
        key: "0100000000000",
        text: "Республика Адыгея (Адыгея)",
    },
    {
        key: "0400000000000",
        text: "Республика Алтай",
    },
    {
        key: "0200000000000",
        text: "Республика Башкортостан",
    },
    {
        key: "0300000000000",
        text: "Республика Бурятия",
    },
    {
        key: "0500000000000",
        text: "Республика Дагестан",
    },
    {
        key: "0600000000000",
        text: "Республика Ингушетия",
    },
    {
        key: "0800000000000",
        text: "Республика Калмыкия",
    },
    {
        key: "1000000000000",
        text: "Республика Карелия",
    },
    {
        key: "1100000000000",
        text: "Республика Коми",
    },
    {
        key: "9100000000000",
        text: "Республика Крым",
    },
    {
        key: "1200000000000",
        text: "Республика Марий Эл",
    },
    {
        key: "1300000000000",
        text: "Республика Мордовия",
    },
    {
        key: "1400000000000",
        text: "Республика Саха (Якутия)",
    },
    {
        key: "1500000000000",
        text: "Республика Северная Осетия - Алания",
    },
    {
        key: "1600000000000",
        text: "Республика Татарстан (Татарстан)",
    },
    {
        key: "1700000000000",
        text: "Республика Тыва",
    },
    {
        key: "1900000000000",
        text: "Республика Хакасия",
    },
    {
        key: "6100000000000",
        text: "Ростовская область",
    },
    {
        key: "6200000000000",
        text: "Рязанская область",
    },
    {
        key: "6300000000000",
        text: "Самарская область",
    },
    {
        key: "6400000000000",
        text: "Саратовская область",
    },
    {
        key: "6500000000000",
        text: "Сахалинская область",
    },
    {
        key: "6600000000000",
        text: "Свердловская область",
    },
    {
        key: "6700000000000",
        text: "Смоленская область",
    },
    {
        key: "2600000000000",
        text: "Ставропольский край",
    },
    {
        key: "6800000000000",
        text: "Тамбовская область",
    },
    {
        key: "6900000000000",
        text: "Тверская область",
    },
    {
        key: "7000000000000",
        text: "Томская область",
    },
    {
        key: "7100000000000",
        text: "Тульская область",
    },
    {
        key: "7200000000000",
        text: "Тюменская область",
    },
    {
        key: "1800000000000",
        text: "Удмуртская Республика",
    },
    {
        key: "7300000000000",
        text: "Ульяновская область",
    },
    {
        key: "2700000000000",
        text: "Хабаровский край",
    },
    {
        key: "8600000000000",
        text: "Ханты-Мансийский автономный округ - Югра",
    },
    {
        key: "9500000000000",
        text: "Херсонская область",
    },
    {
        key: "7400000000000",
        text: "Челябинская область",
    },
    {
        key: "2000000000000",
        text: "Чеченская Республика",
    },
    {
        key: "2100000000000",
        text: "Чувашская Республика - Чувашия",
    },
    {
        key: "8700000000000",
        text: "Чукотский автономный округ",
    },
    {
        key: "8900000000000",
        text: "Ямало-Ненецкий автономный округ",
    },
    {
        key: "7600000000000",
        text: "Ярославская область",
    },
];
